/*
 *   split() : => String[] 
 *   ¹®ÀÚ¸¦ ±¸ºĞÇØ¼­ ÀÚ¸£´Â ¿ªÇÒ 
 *   
 *   "¹Ø¹İÂù",¸ŞÀÎ¹İÂù,±¹/ÅÁ,Âî°³,µğÀúÆ®,¸é/¸¸µÎ¹ä,Á×/¶±Ç»,Àü,±èÄ¡/Á£°¥,Àå·ù,¾ç³ä,¼Ò½º/Àë,¾ç½Ä,»ø·¯µå,½ºÇÁ,»§,°úÀÚ,Â÷/À½·á,
 *   ¼ú,±âÅ¸
 *   
 *   °á¹é(2019)|»ó¿µÁß|07 . 8|µå¶ó¸¶|ÇÑ±¹|2020.06.10|110ºĞ|15¼¼ÀÌ»ó°ü¶÷°¡|¹Ú»óÇö ÁÖ¿¬ ½ÅÇı¼±, ¹èÁ¾¿Á, ÇãÁØÈ£\n

     /^([a-z0-9_\.-]+)@([\da-z\.-]+)\.([a-z\.]{2,6})$/
      * 
     [0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}
     
         ¸ÀÀÖ[°¡-ÆR]+
         
         Â¥[°¡-ÆR]+
 */
public class ¹®ÀÚ¿­5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        String msg="¹Ø¹İÂù?¸ŞÀÎ¹İÂù?±¹/ÅÁ?Âî°³?µğÀúÆ®?¸é/¸¸µÎ¹ä?Á×/¶±Ç»?Àü?±èÄ¡/Á£°¥?Àå·ù?¾ç³ä?¼Ò½º/Àë?¾ç½Ä?»ø·¯µå?½ºÇÁ?»§?°úÀÚ?Â÷/À½·á?" 
		          +"¼ú?±âÅ¸";
        String[] arr=msg.split("\\?"); // ÀÏ¹İ¹®ÀÚ¿­ => ¹è¿­·Î º¯°æ
        //msg.sp => regex
        // ¹®ÀÚÀÏ¶§¸¸ »ç¿ëÀÌ °¡´É 
        for(String s:arr)
        {
        	System.out.println(s);
        }
	}

}






